In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Data.csv', sep=r'\s*,\s*',
                           header=0, encoding='ascii', engine='python')

In [3]:
df

     Product  Units Sold
0       Quad         154
1    Carlota          12
2       Quad           1
3   Sunshine         256
4      Aspen           1
5      Aspen          57
6   Sunshine         249
7       Quad          47
8    Carlota         120
9    Carlota          66
10   Carlota          57
11  Sunshine         250
12     Aspen          32

In [5]:
df2 = df.groupby('Product')['Units Sold'].mean()

In [6]:
df2

Product
Aspen        30.000000
Carlota      63.750000
Quad         67.333333
Sunshine    251.666667
Name: Units Sold, dtype: float64

In [7]:
df2.round(2)
#super easy way to format floats

Product
Aspen        30.00
Carlota      63.75
Quad         67.33
Sunshine    251.67
Name: Units Sold, dtype: float64

In [9]:
df2 = df.groupby('Product')['Units Sold'].sum()
df2

Product
Aspen        90
Carlota     255
Quad        202
Sunshine    755
Name: Units Sold, dtype: int64

In [11]:
df2 = df.groupby('Product')['Units Sold'].count()
df2

Product
Aspen       3
Carlota     4
Quad        3
Sunshine    3
Name: Units Sold, dtype: int64

In [14]:
df2 = df.groupby('Product')['Units Sold'].std()
df2.round(2)

Product
Aspen       28.05
Carlota     44.32
Quad        78.50
Sunshine     3.79
Name: Units Sold, dtype: float64